'=======================GIT====================='
# это распределенная система контроля версий (это система, записывающая изменения в файл или набор файлов в течение
времени).Презназначен для отслеживания и ведения истории изменения файлов, в вашем проекте

'=======================GITHUB=================='
# это сайт куда я могу отправить все что находится на моем ноутбуке, чтобы другие людит могли просматривать
мой код и мой прогресс, так же использовать мой код

'Репозиторий'
# хранилище проекта

# 1.локальный (на ноутбуке)
# 2.уудаленный (на каком-то сервисе, который предоставляет репозиторий(GITHUB))
